public class Parsing {

    /*
    запросить у пользователя через util предоставить нам зашифрованный файл и файл для набора статистики
    на основании которого мы проанализирует сколько каждый символ имеет количество повторений

    создать две таблицы со статистикой по обоим текстам
    создать третью таблицу куда взять значения этих максимальных количеств и сопоставить их
    нужно создать три хэш-карты
    1) ключ - символ, значение - количество вхождений (для зашифрованного файла - Encrypted)
    1) ключ - символ, значение - количество вхождений (для файла статистики - Statistics)
    3) ключ - символ из Encrypted, значение - символ из Statistics (для расшифровки - Decrypted)

    с помощью этой карты расшифровать результат максимально приемлемо

     */
    public void parse() {

    }
}
